# IsEqual Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
PointCloudColorSettings..::..IsEqual Method
PointCloudColorSettings Class See Also
---
Check if the contents of two settings are equal.
**Namespace:** Autodesk.Revit.DB.PointClouds**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public bool IsEqual(
	PointCloudColorSettings other
)
```

Visual Basic
---
```text
Public Function IsEqual ( _
	other As PointCloudColorSettings _
) As Boolean
```

Visual C++
---
```text
public:
bool IsEqual(
	PointCloudColorSettings^ other
)
```

# ### Parameters
other
    Type: Autodesk.Revit.DB.PointClouds..::..PointCloudColorSettings The settings to be compared.
# ### Return Value
True for equal, false otherwise.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
PointCloudColorSettings Class
Autodesk.Revit.DB.PointClouds Namespace